{
  "query": "iphone 12",
  "search_url": "https://www.amazon.in/s?k=iphone+12&ref=nb_sb_noss",
  "total_products": 3,
  "products": [
    {
      "name": "Apple iPhone 12 (128GB) - White",
      "price": "₹54,900.00",
      "brand": "Visit the Apple Store",
      "category": "",
      "rating": "Customer reviews\n4.5 out of 5\n32,968 global ratings\n5 star\n75%\n4 star\n17%\n3 star\n3%\n2 star\n1%\n1 star\n4%\nHow are ratings calculated?\nCustomers say\nCustomers find the iPhone's display crisp and clear, with superb camera capabilities and a premium feel. The phone receives positive feedback for its performance, though some report it won't turn on. Battery life and value for money receive mixed reviews - while some say it lasts a whole day, others find the battery drains too fast, and while some consider it worth the high price, others disagree. The phone overheats significantly during use.\nGenerated from the text of customer reviews\nSelect to learn more\nPhone quality\nCamera quality\nDisplay quality\nDesign\nBattery life\nValue for money\nPerformance\nPhone heat\n\nReviews with images\nSee all photos\nTop reviews from India\nAman Negi\nProduct review\nReviewed in India on 24 August 2025\nVerified Purchase\nExcellent product using since 2022 it has been 3 years only battery backup is not good and heating in 5G mode otherwise this phone is better than my expectations\n2 people found this helpful\nHelpful\nReport\nAashik Francis\nConfused? Read on! One stop review for your flagship purchase.\nReviewed in India on 4 August 2021\nColour: BlackSize: 128GBPattern Name: iPhone 12Verified Purchase\nI went through a lot of reviews and articles before I decided on the iPhone 12. I’ve been an Android user all my life and frankly thought Apple phones were really overpriced(at least here in India). But in the present day, the flagship Android options are no less expensive.\nIf you spend a lot of time on your mobile, using it as your primary camera, social media device, business emails/collaboration and also to stream videos then you definitely need to spend a little more and go with a flagship option for the best experience.\n\nComing to the flagships today (Aug2021), apart from the iPhone we have Samsung Galaxy S21/+/ultra, Oneplus 9 pro, Vivo x60 pro+, mi 11ultra. If you read a few reviews you’ll understand that 888Snapdragon has a lot of heating issues and 9pro cameras didn’t live up to the hype(also overheating when the camera is in use). Samsung in India ships the phone with exynos2100 which is way less powerful than 888. The prices of all these phones are in the same range (except the ultra). Imp note: iOS updates are across iPhone devices unlike the android updates.\n\nApple has really done a lot of things right on the iPhone12:\n\n1. They changed its display from lcd to led (huge value jump)\n2. A14 Bionic chip is a really fast and smooth without any lag\n3. Huge improvement on the primary cameras. Still the best video recording phone in the market and the photos are top quality\n4. The change is the body design is really comfortable in the hand\n5. The haptics are spot on\n\nWhat’s Missing: (Minor misses though)\n1. The Notch. Really wish they get rid of the notch but looks like it wont be out until 2023. Anyway you’ll get used to it.\n2. USB type C charging. The iPad Pro 2020 model onwards already comes with the TypeC usb charging. I guess the iPhone 13 would get this change\n3. Fingerprint Sensor: Yes. Apple had done away with it couple of years back but with the pandemic still on, you sometimes wish there was a fingerprint sensor\n\nWait for the iPhone 13 or go with the 12:\nIt took a while for 12’s prices to fall. If you’re willing to wait till Feb-March 2022 for a good deal then wait for the 13. If you want to change it now, go with the 12.\n\n64GB or 128GB:\nThe difference is around ₹6000. 64GB if you don’t play too many games and keep dumping the media files every once in while to your pc/storage . Else, the 128😊\n\nBattery:\nI was indeed very surprised with the battery life. Charging time is a little slower compared to it’s competition but the back up is impressive. It easily lasts a day.\n\nAndroid Flagship Option:\nThe truth is, right now is not a good time to purchase an android flagship. If you really want to buy an android flagship, do wait for a while. 895 snapdragon phones are expected to be out by end of the year or early 2022.\n\nHope this review helped :)\n\nUpdate:\n\n13 gets a better cam sensor, a15 bionic, 10% bigger battery and a slightly smaller notch. That’s it. No more differences. Everything else remains the same.\n\niPhone 13 launched at 80k which is lesser than 12’s launch price(86k). If you want to save on some cash , 12 will still do the job (12 is currently around 55k-62k). However if you can spend that extra 20k, then 13 should be your pick.\n\nPlanning on taking an Android? Definitely wait until early 2022.\nRead more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n143 people found this helpful\nHelpful\nReport\nRakhuNathan\nNot Really worth the money\nReviewed in India on 18 December 2020\nVerified Purchase\nI have been an android user for the past 8+ years. Recently was using iphone 6 for the past few months, liked it much and wanted to switch to ios. I did not want to regret, so i purchased the best in the market, going with iphone 12. Honestly, I dont feel its worthy. Perfomance wise, its good. A lot other phones like MI, 1+ everything gives us a very nice perfomance too. The A14 chip is just a tag line to sell the phone. Are we really going to process million instructions per second on a mobile phone? Defenitely not.\n\nBattery, After charging it to 100% in the morning, I am hardly getting 1 full day with average use. My battery is almost 20% at the end of the day with a screentime of 4-4.3 hours[Update : With low power mode, it makes a 6 hour day, ending with 30%]. Camera quality is amazing in natural light. Yes, as specified it works so nice in night light, but please dont mistake night light as no-light. Front camera is still average. The same things i see in every other mid range android phones. I am still using JIO 4g. Not sure how this would work on 5g (must drain even faster)\n\nFace detenction, the color of the phone, Water resistant and all stuffs are nice to have, fancy items. But not really convinced if this is all we get for 84k?\n\nFast charging - I bought a 20W charger from apple store for Rs.1900. I plug in when the battery is 20-25% and it takes 1.45 hours to reach 100%. If this is all about fast charging you are looking for, well and good. I never tried with magsafe, honestly. But this to me doesnt seem fast charging for 2800~ mah battery.\n\nI wont say that this phone is too poor. It gives us all that it promises. Personally I dont recommend investing 85k Indian money into this. Either go for lower versions of other iphones like 11 or you can wait for an year and buy this at cheaper cost.\n\nPROS : Camera & Perfomance\nCONS : Battery and Cost\nRead more\n230 people found this helpful\nHelpful\nReport\nYash mohnani\nIphone 12\nReviewed in India on 12 September 2025\nVerified Purchase\nOne of the best phone\nHelpful\nReport\nKuldeep singh\nbest mobile in this era\nReviewed in India on 26 July 2025\nColour: WhiteSize: 128GBPattern Name: iPhone 12Verified Purchase\nbest mobile in this era\nHelpful\nReport\nSee more reviews",
      "reviews_count": "32,968 ratings",
      "availability": "Only 1 left in stock.",
      "link": "https://www.amazon.in/New-Apple-iPhone-12-128GB/dp/B08L5S1NT7/ref=sr_1_1_sspa?dib=eyJ2IjoiMSJ9.X_o8EWIQYOC4QlUJCX6-mmLQVRGBQMHtjzUB9FI3j0uQ1-Zl1r0iaUBQC8fmWwY4t8kWiKrmxPN-a9vrEk9MC3PIYjRxz6WU_i3WAIaLX7zdDjgE5r27HpPDS4jqb0v55eJ-YVRNTMoNVR-rDGQBgWz18RTCzC7ufwWOQfQOUUDIx3_8jgnJ5zjwLa3JsvCJSpLoNVoOLl6IzSroYzEdgFlckVdUfevn84BdsyQV6Zs.laoF0kAGSDqUpp5zA3CGPRS_So9RpCQFEepZ_7evX70&dib_tag=se&keywords=iphone%2B12&nsdOptOutParam=true&qid=1758729804&sr=8-1-spons&sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&th=1",
      "images": [
        {
          "url": "https://m.media-amazon.com/images/I/711wsjBtWeL._SX522_.jpg",
          "alt": "Apple iPhone 12 (128GB) - White",
          "thumbnail": "https://m.media-amazon.com/images/I/711wsjBtWeL._SX522_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/G/31/HomeCustomProduct/360_icon_73x73v2._CB485971317_SX38_SY50_CR,0,0,38,50_FMpng_RI_.png",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/G/31/HomeCustomProduct/360_icon_73x73v2._CB485971317_SX38_SY50_CR,0,0,38,50_FMpng_RI_.png"
        },
        {
          "url": "https://m.media-amazon.com/images/I/317JiGToz-L._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/317JiGToz-L._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/91ewXAzTtGL._SX35_SY46._CR0,0,35,46_BG85,85,85_BR-120_PKdp-play-icon-overlay__.png",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/91ewXAzTtGL._SX35_SY46._CR0,0,35,46_BG85,85,85_BR-120_PKdp-play-icon-overlay__.png"
        },
        {
          "url": "https://m.media-amazon.com/images/I/31-gIg+D+qL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/31-gIg+D+qL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/41Qh-UBd5mL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/41Qh-UBd5mL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/41G+mcwRgfS._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/41G+mcwRgfS._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/41y5eACp2eL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/41y5eACp2eL._SX38_SY50_CR,0,0,38,50_.jpg"
        }
      ],
      "specifications": {}
    },
    {
      "name": "Apple iPhone 15 (128 GB) - Blue",
      "price": "₹69,900",
      "brand": "Visit the Apple Store",
      "category": "Smartphones",
      "rating": "Customer reviews\n4.5 out of 5\n5,085 global ratings\n5 star\n75%\n4 star\n15%\n3 star\n4%\n2 star\n1%\n1 star\n5%\nHow are ratings calculated?\nCustomers say\nCustomers find this iPhone to be a high-quality device with impressive camera performance, particularly praising its DSLR-like picture quality. The phone receives positive feedback for its looks, speed, and value for money. However, the battery life and performance show mixed results - while some report fast battery life, others say it drains too quickly, and while some find it smoothly working, others report it not functioning properly. Moreover, customers express concerns about overheating issues, noting that the phone gets hot within minutes of use.\nGenerated from the text of customer reviews\nSelect to learn more\nPhone quality\nCamera quality\nValue for money\nLooks\nSpeed\nBattery life\nPerformance\nHeat level\n\nReviews with images\nSee all photos\nTop reviews from India\nHINDUSTAN ELECTRICALS\niPhone 15 A solid upgrade and value for money\nReviewed in India on 6 October 2023\nColour: BlackSize: 128 GBVerified Purchase\nDesign\nOne of the most noticeable changes to the iPhone 15 is its new design. The phone now has rounded edges, which makes it feel more comfortable in the hand. It also has a new camera bump that is less pronounced than the one on the iPhone 14.\n\nDisplay\nThe iPhone 15 has the same 6.1-inch Super Retina XDR display as the iPhone 14. However, the new display is brighter and has better contrast. It also supports HDR10 and Dolby Vision.\n\nPerformance\nThe iPhone 15 is powered by the new A16 Bionic chip, which is the fastest mobile chip on the market. The A16 Bionic chip is up to 20% faster than the A15 Bionic chip in the iPhone 14.\n\nCamera\nThe iPhone 15 has a new 48-megapixel main camera. The new camera sensor is larger than the one in the iPhone 14, and it has better low-light performance. The iPhone 15 also has a new 12-megapixel ultrawide camera and a new 12-megapixel telephoto camera.\n\nBattery life\nThe iPhone 15 has the same battery life as the iPhone 14. This means that you can expect to get around a day of use on a single charge. Overall The iPhone 15 is a solid upgrade over the iPhone 14.\n\nPros\nNew design with rounded edges\nMore powerful A16 Bionic chip found in 14 pro\nNew 48-megapixel main camera\nBrighter display with upto 2000 nits brightness\nUSB C can be used for anything\nDynamic Island\n\nCons\nNo 120hz display\nNo Macro photography\nRead more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n455 people found this helpful\nHelpful\nReport\nNIDHI SOMANI\nStunning Pink – A Perfect Blend of Beauty & Performance\nReviewed in India on 21 March 2025\nColour: PinkSize: 128 GBVerified Purchase\nI recently purchased the iPhone 15 in Pink from Amazon, and I couldn’t be happier with my decision! From the moment I unboxed it, the sleek design and soft pastel pink color caught my attention—it looks even better in person than in pictures. Phone is lightweight aluminum and glass build, making the phone feel premium yet comfortable to hold. The pink shade is elegant and subtle, perfect for anyone who loves a touch of sophistication. The 6.1-inch Super Retina XDR display is bright, sharp, and offers vibrant colors. Whether watching videos or scrolling through social media, the experience is smooth and immersive. The 48MP main camera and 12MP ultra-wide lens take incredible photos, even in low light. The details, sharpness, and colors are truly impressive. Portrait mode works beautifully, capturing professional-looking shots effortlessly. The front camera is equally good for selfies and FaceTime. Charging with the USB-C port is much more convenient than before, and fast charging is a plus. The delivery was fast and secure, with the iPhone arriving in perfect condition. The packaging was intact, and setting up the phone was a breeze. If you're looking for a stylish, powerful, and reliable phone, the iPhone 15 in Pink is a fantastic choice.\n94 people found this helpful\nHelpful\nReport\nSahil Arora\n⭐️⭐️⭐️⭐️⭐️ Sleek, Fast & Reliable – A Solid Upgrade\nReviewed in India on 26 May 2025\nColour: GreenSize: 128 GBVerified Purchase\nThe iPhone 15 is a noticeable step up from previous models. The design feels premium, and the new green color is subtle yet refreshing. Performance is smooth — apps launch instantly, and multitasking is seamless. The camera system is excellent, especially in low light, and photos come out crisp and vibrant. Battery life easily lasts a full day, even with heavy use. The display is bright and clear, perfect for watching videos or browsing. If you're upgrading from an older iPhone, the iPhone 15 feels like a worthy investment. It’s reliable, fast, and beautifully designed.\n21 people found this helpful\nHelpful\nReport\nabhinav p.\nGood\nReviewed in India on 3 September 2025\nColour: BlackSize: 128 GBVerified Purchase\nAmazing phone\nOne person found this helpful\nHelpful\nReport\nSandy Cariappa\niPhone XR to iPhone 15\nReviewed in India on 7 October 2023\nColour: BlueSize: 128 GBVerified Purchase\nJust made the transition and here’s my POV on the first ~2 month of use\n\nPros\n- Battery Life is awesome, easily get about a day plus on this, so no Compliants\n- Screen fluidity is smooooooth! Understandable as I’m transitioning into an OLED from LCD in XR. The panel gets a solid peak brightness quotient so happy here\n- Screen brightness is good as compared to XR, 2200 nits, but I hardly go beyond 30% brightness to save some juice. Whilst outside I did crank it up and it’s spotless\n- Dynamic Island is fun, yet to use it to the fullest. Like the way it shows the ETA on delivery and Uber. Simple solution instead of you having to get into the app to check on the ETA\n- Weight, this phone is soo bloody light!! Understandable as XR was a brick, this is soo welcome\n- Camera is awesome, love the 48MP intervention, the portrait mode and cinematic mode does the job for me.\n- The Apple eco system, I enjoy seamless integration of my Watch, Mac, IPad Air and IPhone\n- Apples approach on Security!\n- Transferring data from my XR to 15 using the built in app is flawless\n\nCons\n- The phone was over heating , there is a solution to this from Apple = back up the phone and then erase and reset the phone… including your eSIM settings.. once done set up the phone with the back up….. works like a charm\n- I still believe Apple should have thrown in a charging brick with such purchases\n\nIndustry memes\n- USB C : honestly don’t give a jack for the reviews out there on this. It’s just a mode of charging for me and that’s it. I’m not going to be transferring any data so yea, 2.0 speed yadadada - thank you so much\n- Blue is not blue but white! Think people whining about this should go back to 13/14 or those ludicrous blues in Androids!! These are pestle shades people!!\n- Buying an Apple product to show off!! I mean, you even serious? You buy a product and then comment on why you should not buy one?\n- 60hz refresh rate for a 80k phone : save your jokes people, there are many of us who appreciate quality and security than how the screen refreshes. For non gamers like me, panel that is here is apt. I’ve seen a ton of folks buying 120hz phones and using it only to make calls, watch some videos and for texting\n\nTips of managing battery health\n- Switch off background app refresh for apps you don’t need back ground refresh\n- Avoid wireless charging as this heats your devise up\n- I charge my phone only using a power bank not direct wired or wireless charging\n- Don’t let the battery go below 20%, keep it always between 95% and 20%\n- Switch off location services and allow only certain app that needs your location service\n- Switch on Charging Optimisation under the battery section\n- I don’t use vibrate mode for rings/incoming calls etc\n- My XR after 5 years of use has 86% battery health so I guess I know what I’m recommending above\n\nVendor Experience : Appario Retail Private Limited. 5/5, been a regular customer and they have never disappointed me even once. The purchase experience is breezy and quick, thanks team for the support and look forward to the collaboration in the future.\n\n….. watch out for this space. Will keep updating in case of significant change in experience\nRead more\n876 people found this helpful\nHelpful\nReport\nDivya Singh\nCamera\nReviewed in India on 11 September 2025\nVerified Purchase\nGood quality\n4 people found this helpful\nHelpful\nReport\nChirag Garg\nAffordable and Powerful\nReviewed in India on 4 August 2025\nColour: BlueSize: 128 GBVerified Purchase\nI’ve been using this phone for a while now, and I’m really happy with it. It looks great—sleek and easy to hold—and the screen is super vibrant. Performance is smooth, whether I’m browsing or playing games, with no lag. The camera takes great photos in most conditions, and the battery easily lasts me through the day. It charges quickly too, which is a bonus. Overall, this phone gives great value for the price and has everything I need without the high-end price tag. Totally recommend it!\n6 people found this helpful\nHelpful\nReport\nSee more reviews",
      "reviews_count": "5,085 ratings",
      "availability": "",
      "link": "https://www.amazon.in/Apple-iPhone-15-128-GB/dp/B0CHX2F5QT/ref=sr_1_2_sspa?dib=eyJ2IjoiMSJ9.X_o8EWIQYOC4QlUJCX6-mmLQVRGBQMHtjzUB9FI3j0uQ1-Zl1r0iaUBQC8fmWwY4t8kWiKrmxPN-a9vrEk9MC3PIYjRxz6WU_i3WAIaLX7zdDjgE5r27HpPDS4jqb0v55eJ-YVRNTMoNVR-rDGQBgWz18RTCzC7ufwWOQfQOUUDIx3_8jgnJ5zjwLa3JsvCJSpLoNVoOLl6IzSroYzEdgFlckVdUfevn84BdsyQV6Zs.laoF0kAGSDqUpp5zA3CGPRS_So9RpCQFEepZ_7evX70&dib_tag=se&keywords=iphone%2B12&nsdOptOutParam=true&qid=1758729804&sr=8-2-spons&sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&th=1",
      "images": [
        {
          "url": "https://m.media-amazon.com/images/I/71d7rfSl0wL._SX425_.jpg",
          "alt": "Apple iPhone 15 (128 GB) - Blue",
          "thumbnail": "https://m.media-amazon.com/images/I/71d7rfSl0wL._SX425_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/G/31/HomeCustomProduct/360_icon_73x73v2._CB485971317_SX38_SY50_CR,0,0,38,50_FMpng_RI_.png",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/G/31/HomeCustomProduct/360_icon_73x73v2._CB485971317_SX38_SY50_CR,0,0,38,50_FMpng_RI_.png"
        },
        {
          "url": "https://m.media-amazon.com/images/I/31Q14qzdoZL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/31Q14qzdoZL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/21CSbSnQMpL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/21CSbSnQMpL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/318PoeHeuZL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/318PoeHeuZL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/31XwlUhCeZL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/31XwlUhCeZL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/51Xr-2dfBpL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/51Xr-2dfBpL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/31VXVIKfyHL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/31VXVIKfyHL._SX38_SY50_CR,0,0,38,50_.jpg"
        }
      ],
      "specifications": {}
    },
    {
      "name": "Apple iPhone 12 (256GB) - Purple",
      "price": "₹94,900",
      "brand": "Visit the Apple Store",
      "category": "",
      "rating": "Customer reviews\n4.5 out of 5\n32,968 global ratings\n5 star\n75%\n4 star\n17%\n3 star\n3%\n2 star\n1%\n1 star\n4%\nHow are ratings calculated?\nCustomers say\nCustomers find the iPhone's display crisp and clear, with superb camera capabilities and a premium feel. The phone receives positive feedback for its performance, though some report it won't turn on. Battery life and value for money receive mixed reviews - while some say it lasts a whole day, others find the battery drains too fast, and while some consider it worth the high price, others disagree. The phone overheats significantly during use.\nGenerated from the text of customer reviews\nSelect to learn more\nPhone quality\nCamera quality\nDisplay quality\nDesign\nBattery life\nValue for money\nPerformance\nPhone heat\n\nReviews with images\nSee all photos\nTop reviews from India\nAman Negi\nProduct review\nReviewed in India on 24 August 2025\nVerified Purchase\nExcellent product using since 2022 it has been 3 years only battery backup is not good and heating in 5G mode otherwise this phone is better than my expectations\n2 people found this helpful\nHelpful\nReport\nAashik Francis\nConfused? Read on! One stop review for your flagship purchase.\nReviewed in India on 4 August 2021\nColour: BlackSize: 128GBPattern Name: iPhone 12Verified Purchase\nI went through a lot of reviews and articles before I decided on the iPhone 12. I’ve been an Android user all my life and frankly thought Apple phones were really overpriced(at least here in India). But in the present day, the flagship Android options are no less expensive.\nIf you spend a lot of time on your mobile, using it as your primary camera, social media device, business emails/collaboration and also to stream videos then you definitely need to spend a little more and go with a flagship option for the best experience.\n\nComing to the flagships today (Aug2021), apart from the iPhone we have Samsung Galaxy S21/+/ultra, Oneplus 9 pro, Vivo x60 pro+, mi 11ultra. If you read a few reviews you’ll understand that 888Snapdragon has a lot of heating issues and 9pro cameras didn’t live up to the hype(also overheating when the camera is in use). Samsung in India ships the phone with exynos2100 which is way less powerful than 888. The prices of all these phones are in the same range (except the ultra). Imp note: iOS updates are across iPhone devices unlike the android updates.\n\nApple has really done a lot of things right on the iPhone12:\n\n1. They changed its display from lcd to led (huge value jump)\n2. A14 Bionic chip is a really fast and smooth without any lag\n3. Huge improvement on the primary cameras. Still the best video recording phone in the market and the photos are top quality\n4. The change is the body design is really comfortable in the hand\n5. The haptics are spot on\n\nWhat’s Missing: (Minor misses though)\n1. The Notch. Really wish they get rid of the notch but looks like it wont be out until 2023. Anyway you’ll get used to it.\n2. USB type C charging. The iPad Pro 2020 model onwards already comes with the TypeC usb charging. I guess the iPhone 13 would get this change\n3. Fingerprint Sensor: Yes. Apple had done away with it couple of years back but with the pandemic still on, you sometimes wish there was a fingerprint sensor\n\nWait for the iPhone 13 or go with the 12:\nIt took a while for 12’s prices to fall. If you’re willing to wait till Feb-March 2022 for a good deal then wait for the 13. If you want to change it now, go with the 12.\n\n64GB or 128GB:\nThe difference is around ₹6000. 64GB if you don’t play too many games and keep dumping the media files every once in while to your pc/storage . Else, the 128😊\n\nBattery:\nI was indeed very surprised with the battery life. Charging time is a little slower compared to it’s competition but the back up is impressive. It easily lasts a day.\n\nAndroid Flagship Option:\nThe truth is, right now is not a good time to purchase an android flagship. If you really want to buy an android flagship, do wait for a while. 895 snapdragon phones are expected to be out by end of the year or early 2022.\n\nHope this review helped :)\n\nUpdate:\n\n13 gets a better cam sensor, a15 bionic, 10% bigger battery and a slightly smaller notch. That’s it. No more differences. Everything else remains the same.\n\niPhone 13 launched at 80k which is lesser than 12’s launch price(86k). If you want to save on some cash , 12 will still do the job (12 is currently around 55k-62k). However if you can spend that extra 20k, then 13 should be your pick.\n\nPlanning on taking an Android? Definitely wait until early 2022.\nRead more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n143 people found this helpful\nHelpful\nReport\nRakhuNathan\nNot Really worth the money\nReviewed in India on 18 December 2020\nVerified Purchase\nI have been an android user for the past 8+ years. Recently was using iphone 6 for the past few months, liked it much and wanted to switch to ios. I did not want to regret, so i purchased the best in the market, going with iphone 12. Honestly, I dont feel its worthy. Perfomance wise, its good. A lot other phones like MI, 1+ everything gives us a very nice perfomance too. The A14 chip is just a tag line to sell the phone. Are we really going to process million instructions per second on a mobile phone? Defenitely not.\n\nBattery, After charging it to 100% in the morning, I am hardly getting 1 full day with average use. My battery is almost 20% at the end of the day with a screentime of 4-4.3 hours[Update : With low power mode, it makes a 6 hour day, ending with 30%]. Camera quality is amazing in natural light. Yes, as specified it works so nice in night light, but please dont mistake night light as no-light. Front camera is still average. The same things i see in every other mid range android phones. I am still using JIO 4g. Not sure how this would work on 5g (must drain even faster)\n\nFace detenction, the color of the phone, Water resistant and all stuffs are nice to have, fancy items. But not really convinced if this is all we get for 84k?\n\nFast charging - I bought a 20W charger from apple store for Rs.1900. I plug in when the battery is 20-25% and it takes 1.45 hours to reach 100%. If this is all about fast charging you are looking for, well and good. I never tried with magsafe, honestly. But this to me doesnt seem fast charging for 2800~ mah battery.\n\nI wont say that this phone is too poor. It gives us all that it promises. Personally I dont recommend investing 85k Indian money into this. Either go for lower versions of other iphones like 11 or you can wait for an year and buy this at cheaper cost.\n\nPROS : Camera & Perfomance\nCONS : Battery and Cost\nRead more\n230 people found this helpful\nHelpful\nReport\nYash mohnani\nIphone 12\nReviewed in India on 12 September 2025\nVerified Purchase\nOne of the best phone\nHelpful\nReport\nKuldeep singh\nbest mobile in this era\nReviewed in India on 26 July 2025\nColour: WhiteSize: 128GBPattern Name: iPhone 12Verified Purchase\nbest mobile in this era\nHelpful\nReport\nSee more reviews",
      "reviews_count": "32,968 ratings",
      "availability": "Only 1 left in stock.",
      "link": "https://www.amazon.in/New-Apple-iPhone-12-256GB/dp/B0932RLX4G/ref=sr_1_3?dib=eyJ2IjoiMSJ9.X_o8EWIQYOC4QlUJCX6-mmLQVRGBQMHtjzUB9FI3j0uQ1-Zl1r0iaUBQC8fmWwY4t8kWiKrmxPN-a9vrEk9MC3PIYjRxz6WU_i3WAIaLX7zdDjgE5r27HpPDS4jqb0v55eJ-YVRNTMoNVR-rDGQBgWz18RTCzC7ufwWOQfQOUUDIx3_8jgnJ5zjwLa3JsvCJSpLoNVoOLl6IzSroYzEdgFlckVdUfevn84BdsyQV6Zs.laoF0kAGSDqUpp5zA3CGPRS_So9RpCQFEepZ_7evX70&dib_tag=se&keywords=iphone%2B12&nsdOptOutParam=true&qid=1758729804&sr=8-3&th=1",
      "images": [
        {
          "url": "https://m.media-amazon.com/images/I/71hIfcIPyxS._SX522_.jpg",
          "alt": "Apple iPhone 12 (256GB) - Purple",
          "thumbnail": "https://m.media-amazon.com/images/I/71hIfcIPyxS._SX522_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/G/31/HomeCustomProduct/360_icon_73x73v2._CB485971317_SX38_SY50_CR,0,0,38,50_FMpng_RI_.png",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/G/31/HomeCustomProduct/360_icon_73x73v2._CB485971317_SX38_SY50_CR,0,0,38,50_FMpng_RI_.png"
        },
        {
          "url": "https://m.media-amazon.com/images/I/31jQ91XUDhS._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/31jQ91XUDhS._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/91ewXAzTtGL._SX35_SY46._CR0,0,35,46_BG85,85,85_BR-120_PKdp-play-icon-overlay__.png",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/91ewXAzTtGL._SX35_SY46._CR0,0,35,46_BG85,85,85_BR-120_PKdp-play-icon-overlay__.png"
        },
        {
          "url": "https://m.media-amazon.com/images/I/41F5R8TA37S._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/41F5R8TA37S._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/41Qh-UBd5mL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/41Qh-UBd5mL._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/41G+mcwRgfS._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/41G+mcwRgfS._SX38_SY50_CR,0,0,38,50_.jpg"
        },
        {
          "url": "https://m.media-amazon.com/images/I/4194R9CuygL._SX38_SY50_CR,0,0,38,50_.jpg",
          "alt": "",
          "thumbnail": "https://m.media-amazon.com/images/I/4194R9CuygL._SX38_SY50_CR,0,0,38,50_.jpg"
        }
      ],
      "specifications": {}
    }
  ]
}